src_doc/InformationRegisters/ДескрипторыДляОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДескрипторыДляОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПолученОт</Name>
					<Comment>Все типы из измерения "Объект", плюс Предмет из справочника "ЗаписиРабочегоКалендаря"</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныПисем</v8:Type>
						<v8:Type>cfg:CatalogRef.ТемыОбсуждений</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныУтверждения</v8:Type>
						<v8:Type>cfg:CatalogRef.Контроль</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлектронныйДокументВходящийЭДО</v8:Type>
						<v8:Type>cfg:DocumentRef.ЕженедельныйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ЭлектронныйДокументИсходящийЭДО</v8:Type>
						<v8:Type>cfg:CatalogRef.ЛичныеАдресаты</v8:Type>
						<v8:Type>cfg:CatalogRef.ПравилаОбработкиПисем</v8:Type>
						<v8:Type>cfg:CatalogRef.НоменклатураДел</v8:Type>
						<v8:Type>cfg:CatalogRef.Инструкции</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыКонтрольныхТочек</v8:Type>
						<v8:Type>cfg:CatalogRef.ПапкиФайлов</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныКонтрольныхТочек</v8:Type>
						<v8:Type>cfg:CatalogRef.СпискиРассылкиПоКонтрагентам</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныОзнакомления</v8:Type>
						<v8:Type>cfg:DocumentRef.ВыгрузкаВССТУ</v8:Type>
						<v8:Type>cfg:DocumentRef.ТранспортныйКонтейнерЭДО</v8:Type>
						<v8:Type>cfg:CatalogRef.МестаХраненияДел</v8:Type>
						<v8:Type>cfg:DocumentRef.ВходящееПисьмо</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоступаФизическихЛиц</v8:Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
						<v8:Type>cfg:TaskRef.ЗадачаИсполнителя</v8:Type>
						<v8:Type>cfg:CatalogRef.КатегорииДанных</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыМероприятий</v8:Type>
						<v8:Type>cfg:DocumentRef.ИсходящееПисьмо</v8:Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументов</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныТекстов</v8:Type>
						<v8:Type>cfg:CatalogRef.ЗаписиРабочегоКалендаря</v8:Type>
						<v8:Type>cfg:CatalogRef.РазделыНоменклатурыДел</v8:Type>
						<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
						<v8:Type>cfg:DocumentRef.Бронь</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныРассмотрения</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныСогласования</v8:Type>
						<v8:Type>cfg:DocumentRef.Задача</v8:Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
						<v8:Type>cfg:CatalogRef.ПапкиПисем</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныДокументов</v8:Type>
						<v8:Type>cfg:DocumentRef.Отсутствие</v8:Type>
						<v8:Type>cfg:CatalogRef.ДокументыПредприятия</v8:Type>
						<v8:Type>cfg:CatalogRef.СообщенияОбсуждений</v8:Type>
						<v8:Type>cfg:CatalogRef.Резолюции</v8:Type>
						<v8:Type>cfg:DocumentRef.ДействиеЗадачи</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныКомплексныхБизнесПроцессов</v8:Type>
						<v8:Type>cfg:DocumentRef.ЕжедневныйОтчет</v8:Type>
						<v8:Type>cfg:CatalogRef.ЗаметкиДокументооборота</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныГруппКонтрольныхТочек</v8:Type>
						<v8:Type>cfg:CatalogRef.ПапкиФорума</v8:Type>
						<v8:Type>cfg:CatalogRef.ГрифыДоступа</v8:Type>
						<v8:Type>cfg:CatalogRef.ВизыСогласования</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.ДелаХраненияДокументов</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыКонтактовПользователей</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтрольныеТочки</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныПриглашения</v8:Type>
						<v8:Type>cfg:CatalogRef.ПапкиПроектов</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныИсполнения</v8:Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныПодписания</v8:Type>
						<v8:Type>cfg:CatalogRef.ВопросыДеятельности</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныРегистрации</v8:Type>
						<v8:Type>cfg:DocumentRef.ПередачаДелВАрхив</v8:Type>
						<v8:Type>cfg:CatalogRef.СообщениеЭДОПрисоединенныеФайлы</v8:Type>
						<v8:Type>cfg:CatalogRef.Мероприятия</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
						<v8:Type>cfg:CatalogRef.ПроектныеЗадачи</v8:Type>
						<v8:Type>cfg:CatalogRef.ПапкиМероприятий</v8:Type>
						<v8:Type>cfg:CatalogRef.ПапкиДокументов</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоступаКонтрагентов</v8:Type>
						<v8:Type>cfg:DocumentRef.УничтожениеДел</v8:Type>
						<v8:Type>cfg:CatalogRef.ШаблоныЗадач</v8:Type>
						<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОбъектДоступа</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дескриптор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДескрипторыДоступаОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектМетаданных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипДескриптора</Name>
					<Comment>0 - основной; 1 - по рабочей группе; 2 - индивидуальный; 3 - от владельца; 4 - для локальных администраторов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_doc/InformationRegisters/ПраваПоДескрипторамДоступаОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПраваПоДескрипторамДоступаОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Добавление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Изменение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Удаление</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УправлениеПравами</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Чтение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Дескриптор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДескрипторыДоступаОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектОснование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
						<v8:Type>cfg:CatalogRef.ЗамещающиеИПомощники</v8:Type>
						<v8:Type>cfg:CatalogRef.УдалитьДелегированиеПрав</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_doc/InformationRegisters/ПолномочияСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ПолномочияСотрудников</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КонтейнерыСотрудников</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Полномочия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПрофилиГруппДоступа</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src_doc/Catalogs/ПрофилиГруппДоступа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПрофилиГруппДоступа</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторПоставляемыхДанных</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоставляемыйПрофильИзменен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Роли</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Роль</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовРасширений</v8:Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьРоль</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидыДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДоступа</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВидыДоступа</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Предустановленный</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоступРазрешен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗначенияДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДоступа</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВидыДоступа</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеДоступа</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыДоступа</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Назначение</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТипПользователей</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.Пользователь</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src_doc/CommonModules/ДокументооборотПраваДоступаЛокализация/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

// Составная часть процедуры
// См. ДокументооборотПраваДоступаПовтИсп.ОбъектыСЗависимымиПравами. Здесь можно дополнить массив объектов метаданных,
// чьи права можно рассчитывать многопоточно.
// 
// Параметры:
//  ОбъектыМетаданных - Массив из ОбъектМетаданных
Процедура ДополнитьОбъектыСЗависимымиПравами(ОбъектыМетаданных) Экспорт
	
	// Локализация
	ОбъектыМетаданных.Добавить(Метаданные.Документы.ВыгрузкаВССТУ);
	ОбъектыМетаданных.Добавить(Метаданные.Документы.ТранспортныйКонтейнерЭДО);
	ОбъектыМетаданных.Добавить(Метаданные.Документы.ЭлектронныйДокументВходящийЭДО);
	ОбъектыМетаданных.Добавить(Метаданные.Документы.ЭлектронныйДокументИсходящийЭДО);
	// Конец Локализация
	
КонецПроцедуры

// Возвращает Истина, если запрос прав переопределен в модуле ДокументооборотПраваДоступаЛокализация
// 
// Параметры:
//  ПервыйОбъектДоступа - СправочникОбъект, СправочникСсылка
// 
// Возвращаемое значение:
//  Булево - Запрос прав однотипных объектов подлежит локализации
Функция ЗапросПравОднотипныхОбъектовПодлежитЛокализации(ПервыйОбъектДоступа, ТипОбъекта) Экспорт
	
	// Локализация
	Если ЭтоОбъектДоступаБЭД(ПервыйОбъектДоступа) Тогда
		Возврат Истина;
	КонецЕсли;
	Если ТипОбъекта = Тип("ДокументСсылка.ВыгрузкаВССТУ") Тогда
		Возврат Истина;
	КонецЕсли;
	// Локализация Конец
	
	Возврат Ложь;
	
КонецФункции

Процедура ЗаполнитьЗапросПравОднотипныхОбъектов(ПервыйОбъектДоступа, Запрос,МетаданныеОбъекта, ТипОбъекта) Экспорт
	
	// Локализация
	Если ЭтоОбъектДоступаБЭД(ПервыйОбъектДоступа) Тогда
		
		// Для объектов БЭД дополнительно проверим и наличие полномочий, т.к. права на объекты БЭД
		// сейчас аналогичны правам их организаций. Это может привести к ситуации, когда есть права на организацию,
		// но нет доступа к документам БЭД, а функция при этом возвращает права на чтение.
		
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ДокументЭДО.Ссылка КАК ОбъектДоступа,
			|	ПраваПоДескрипторамДоступаОбъектов.Сотрудник КАК Сотрудник,
			|	ИСТИНА КАК Чтение,
			|	МАКСИМУМ(ПраваПоДескрипторамДоступаОбъектов.Добавление) КАК Добавление,
			|	МАКСИМУМ(ПраваПоДескрипторамДоступаОбъектов.Изменение) КАК Изменение,
			|	МАКСИМУМ(ПраваПоДескрипторамДоступаОбъектов.Удаление) КАК Удаление,
			|	МАКСИМУМ(ПраваПоДескрипторамДоступаОбъектов.УправлениеПравами) КАК УправлениеПравами
			|ИЗ
			|	Документ.ЭлектронныйДокументВходящийЭДО КАК ДокументЭДО
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДескрипторыДляОбъектов КАК ДескрипторыДляОбъектов
			|		ПО (ДокументЭДО.Организация = ДескрипторыДляОбъектов.Объект)
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПраваПоДескрипторамДоступаОбъектов КАК ПраваПоДескрипторамДоступаОбъектов
			|		ПО (ДескрипторыДляОбъектов.Дескриптор = ПраваПоДескрипторамДоступаОбъектов.Дескриптор)
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СотрудникиВКонтейнерах КАК СотрудникиВКонтейнерах
			|		ПО (ПраваПоДескрипторамДоступаОбъектов.Сотрудник = СотрудникиВКонтейнерах.Сотрудник)
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПолномочияСотрудников КАК ПолномочияСотрудников
			|		ПО (СотрудникиВКонтейнерах.Контейнер = ПолномочияСотрудников.Владелец)
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПрофилиГруппДоступа.Роли КАК Роли
			|		ПО (ПолномочияСотрудников.Полномочия = Роли.Ссылка И Роли.Роль = &РольЧтениеПоОрганизациям)
			|ГДЕ
			|	ДокументЭДО.Ссылка В (&ОбъектыДоступа)
			|	И &ПраваПоДескрипторам_ОтборПравообладателей
			|СГРУППИРОВАТЬ ПО
			|	ПраваПоДескрипторамДоступаОбъектов.Сотрудник,
			|	ДокументЭДО.Ссылка
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	ДокументЭДО.Ссылка КАК ОбъектДоступа,
			|	ПраваПоДескрипторамДоступаОбъектов.Сотрудник КАК Сотрудник,
			|	ИСТИНА КАК Чтение,
			|	МАКСИМУМ(ПраваПоДескрипторамДоступаОбъектов.Добавление) КАК Добавление,
			|	МАКСИМУМ(ПраваПоДескрипторамДоступаОбъектов.Изменение) КАК Изменение,
			|	МАКСИМУМ(ПраваПоДескрипторамДоступаОбъектов.Удаление) КАК Удаление,
			|	МАКСИМУМ(ПраваПоДескрипторамДоступаОбъектов.УправлениеПравами) КАК УправлениеПравами
			|ИЗ
			|	Документ.ЭлектронныйДокументВходящийЭДО КАК ДокументЭДО
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ОбъектыУчетаДокументовЭДО КАК ОбъектыУчетаДокументовЭДО
			|		ПО (ДокументЭДО.Ссылка = ОбъектыУчетаДокументовЭДО.ЭлектронныйДокумент)
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДескрипторыДляОбъектов КАК ДескрипторыДляОбъектов
			|		ПО (ОбъектыУчетаДокументовЭДО.ОбъектУчета = ДескрипторыДляОбъектов.Объект)
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПраваПоДескрипторамДоступаОбъектов КАК ПраваПоДескрипторамДоступаОбъектов
			|		ПО (ДескрипторыДляОбъектов.Дескриптор = ПраваПоДескрипторамДоступаОбъектов.Дескриптор)
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СотрудникиВКонтейнерах КАК СотрудникиВКонтейнерах
			|		ПО (ПраваПоДескрипторамДоступаОбъектов.Сотрудник = СотрудникиВКонтейнерах.Сотрудник)
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПолномочияСотрудников КАК ПолномочияСотрудников
			|		ПО (СотрудникиВКонтейнерах.Контейнер = ПолномочияСотрудников.Владелец)
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПрофилиГруппДоступа.Роли КАК Роли
			|		ПО (ПолномочияСотрудников.Полномочия = Роли.Ссылка И Роли.Роль = &РольЧтениеПоСвязаннымДокументам)
			|ГДЕ
			|	ДокументЭДО.Ссылка В (&ОбъектыДоступа)
			|	И &ПраваПоДескрипторам_ОтборПравообладателей
			|СГРУППИРОВАТЬ ПО
			|	ПраваПоДескрипторамДоступаОбъектов.Сотрудник,
			|	ДокументЭДО.Ссылка";
			
		Запрос.УстановитьПараметр("РольЧтениеПоОрганизациям",
			ОбщегоНазначения.ИдентификаторОбъектаМетаданных(
				Метаданные.Роли.ЧтениеЭлектронныхДокументовПоОрганизациямДокументооборот));
		Запрос.УстановитьПараметр("РольЧтениеПоСвязаннымДокументам",
			ОбщегоНазначения.ИдентификаторОбъектаМетаданных(
				Метаданные.Роли.ЧтениеЭлектронныхДокументовПоДокументамДО));
				
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЭлектронныйДокументВходящийЭДО", МетаданныеОбъекта.Имя);
	
	ИначеЕсли ТипОбъекта = Тип("ДокументСсылка.ВыгрузкаВССТУ") Тогда
		
		#Область Запрос_ВыгрузкаВССТУ
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ВыгрузкаВССТУ.Ссылка КАК ОбъектДоступа,
			|	ПраваПоДескрипторамДоступаОбъектов.Сотрудник,
			|	ПраваПоДескрипторамДоступаОбъектов.Пользователь,
			|	ИСТИНА КАК Чтение,
			|	МАКСИМУМ(ПраваПоДескрипторамДоступаОбъектов.Добавление) КАК Добавление,
			|	МАКСИМУМ(ПраваПоДескрипторамДоступаОбъектов.Изменение) КАК Изменение,
			|	МАКСИМУМ(ПраваПоДескрипторамДоступаОбъектов.Удаление) КАК Удаление,
			|	МАКСИМУМ(ПраваПоДескрипторамДоступаОбъектов.УправлениеПравами) КАК УправлениеПравами
			|ИЗ
			|	Документ.ВыгрузкаВССТУ КАК ВыгрузкаВССТУ
			|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
			|	РегистрСведений.ДескрипторыДляОбъектов КАК ДескрипторыДляОбъектов
			|		ПО ВыгрузкаВССТУ.Организация = ДескрипторыДляОбъектов.Объект
			|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
			|	РегистрСведений.ПраваПоДескрипторамДоступаОбъектов КАК ПраваПоДескрипторамДоступаОбъектов
			|		ПО ДескрипторыДляОбъектов.Дескриптор = ПраваПоДескрипторамДоступаОбъектов.Дескриптор
			|		
			|ГДЕ
			|	ВыгрузкаВССТУ.Ссылка В (&ОбъектыДоступа)
			|	И &ПраваПоДескрипторам_ОтборПравообладателей
			|
			|СГРУППИРОВАТЬ ПО
			|	ВыгрузкаВССТУ.Ссылка,
			|	ПраваПоДескрипторамДоступаОбъектов.Сотрудник,
			|	ПраваПоДескрипторамДоступаОбъектов.Пользователь";
		#КонецОбласти
	
	КонецЕсли;
	
	// Локализация Конец
	
КонецПроцедуры

// Возвращает Истина, если получение описания объекта доступа переопределено в модуле ДокументооборотПраваДоступаЛокализация
// 
// Параметры:
//  ОбъектДоступа - СправочникОбъект, СправочникСсылка
// 
// Возвращаемое значение:
//  Булево - Описание объекта доступа подлежит локализации
Функция ОписаниеОбъектаДоступаПодлежитЛокализации(ОбъектДоступа) Экспорт

// Локализация
	Если ЭтоОбъектДоступаБЭД(ОбъектДоступа) Тогда
		Возврат Истина;
	КонецЕсли;
// Локализация Конец

	Возврат Ложь;

КонецФункции

// Возвращает описание объекта доступа.
// 
// Параметры:
// 	ОбъектДоступа - Объект, Ссылка
// 
// Возвращаемое значение:
// 	Объект, Структура - для объекта возвращает его самого, для ссылки возвращает структуру реквизитов.
// 
Функция ОписаниеОбъектаДоступа(ОбъектДоступа) Экспорт
	
	// Локализация
	Если ЭтоОбъектДоступаБЭД(ОбъектДоступа) Тогда
		Возврат ОписаниеОбъектаДоступаБЭД(ОбъектДоступа);
	КонецЕсли;
	// Локализация Конец
	
КонецФункции

// Возвращает Истина, если определение дескрипторов объекта переопределено в модуле ДокументооборотПраваДоступаЛокализация
// 
// Параметры:
//  ОбъектДоступа - СправочникОбъект, СправочникСсылка
// 
// Возвращаемое значение:
//  Булево - Определение дескрипторов объекта подлежит локализации
Функция ОпределениеДескрипторовОбъектаПодлежитЛокализации(ОбъектДоступа) Экспорт
	
	// Локализация
	Если ЭтоОбъектДоступаБЭД(ОбъектДоступа) Тогда
		Возврат Истина;
	КонецЕсли;
	// Локализация Конец
	
	Возврат Ложь;
	
КонецФункции

// Определяет дескрипторы доступа для указанного объекта доступа и записывает их в базу.
// 
// Параметры:
//  ОбъектДоступа - Ссылка, Объект - объект, дескрипторы которого надо определить или ссылка на него.
//  ТаблицаДескрипторов  - ТаблицаЗначений
//  ОпределятьЗависимыеПрава - Булево - признак необходимости определения зависимых прав.
//  ПротоколРасчетаПрав - Массив, Неопределено - протокол расчет прав для отображения в интерфейсе.
// 
// Возвращаемое значение:
//  Таблица значений - итоговая таблица дескрипторов объекта.
Процедура ОпределитьДескрипторыОбъекта(ОбъектДоступа, ТаблицаДескрипторов, ОпределятьЗависимыеПрава = Истина, ПротоколРасчетаПрав = Неопределено) Экспорт
// Локализация
	Если ЭтоОбъектДоступаБЭД(ОбъектДоступа) Тогда
		ЗаполнитьДескрипторыОбъектаБЭД(ОбъектДоступа, ТаблицаДескрипторов, ПротоколРасчетаПрав);
	КонецЕсли;
// Локализация Конец
КонецПроцедуры

#КонецОбласти

// Локализация
#Область СлужебныеПроцедурыИФункции

#Область ПраваНаОбъектыБЭД

// Возвращает описание типов со ссылками на документы БЭД, для которых нужно определять дескрипторы особым образом
// 
// Возвращаемое значение:
//  ОписаниеТипов - Типы ссылок БЭД, для которых нужно определять дескрипторы
Функция ТипыСсылокБЭДДляОпределенияДескрипторов()
	
	Типы = Новый Массив;
	Типы.Добавить(Тип("ДокументСсылка.ЭлектронныйДокументВходящийЭДО"));
	Типы.Добавить(Тип("ДокументСсылка.ЭлектронныйДокументИсходящийЭДО"));
	Типы.Добавить(Тип("ДокументСсылка.ТранспортныйКонтейнерЭДО"));

	Результат = Новый ОписаниеТипов(Типы);
	
	Возврат Результат;
	
КонецФункции

// Проверяет, относится ли объект доступа к БЭД. Если да, то для него нужно рассчитывать дескрипторы самостоятельно.
// 
// Параметры:
//  ОбъектДоступа - ДокументОбъект, ДокументСсылка
// 
// Возвращаемое значение:
//  Булево - Это объект доступа БЭД
Функция ЭтоОбъектДоступаБЭД(ОбъектДоступа)
	
	ТипСсылки = ТипЗнч(ОбъектДоступа.Ссылка);
	
	Возврат ТипыСсылокБЭДДляОпределенияДескрипторов().СодержитТип(ТипСсылки);
	
КонецФункции

// Возвращает описание объекта доступа.
// 
// Параметры:
// 	ОбъектДоступа - Объект, Ссылка
// 
// Возвращаемое значение:
// 	Объект, Структура - для объекта возвращает его самого, для ссылки возвращает структуру реквизитов.
Функция ОписаниеОбъектаДоступаБЭД(ОбъектДоступа)
	
	ОписаниеОбъекта = ОбъектДоступа;
	
	Если ОбщегоНазначения.ЭтоСсылка(ТипЗнч(ОбъектДоступа)) Тогда
		
		// Для ссылки дескриптор заполняется на основании описания.
		СведенияОПоляхДоступа = "Ссылка, Организация";
		ОписаниеОбъекта = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
			ОбъектДоступа, СведенияОПоляхДоступа);
		
		Если Не ЗначениеЗаполнено(ОписаниеОбъекта.Ссылка) Тогда
			ОписаниеОбъекта.Ссылка = ОбъектДоступа;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ОписаниеОбъекта;
	
КонецФункции

// Заполняет дескрипторы доступа для документов БЭД.
// Для документов БЭД права доступа аналогичны правам на чтение организации документа.
// 
// Параметры:
//  ОписаниеОбъекта - См. ОписаниеОбъектаДоступаБЭД
//  ТаблицаДескрипторов - ТаблицаЗначений
//  ПротоколРасчетаПрав - Массив, Неопределено - протокол расчет прав для отображения в интерфейсе
//
Процедура ЗаполнитьДескрипторыОбъектаБЭД(ОписаниеОбъекта, ТаблицаДескрипторов, ПротоколРасчетаПрав)
	
	ДокументооборотПраваДоступа.ЗаполнитьДескрипторыОбъектаОтВладельца(ОписаниеОбъекта,
		ТаблицаДескрипторов, ОписаниеОбъекта.Организация);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
// Локализация Конец
